Tekla Open API Reference for Tekla Structures 2025
AnalysisModelModalAnalysisProperties.ModalAnalysisMassLoadGroupIds Property
 The mass load group indentifier of the modal analysis.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<Identifier> ModalAnalysisMassLoadGroupIds { get; set; }
Public Property ModalAnalysisMassLoadGroupIds As List(Of Identifier)
	Get
	Set
Property Value
Type: List<Identifier>
See Also
Reference
AnalysisModelModalAnalysisProperties Class
Tekla.Structures.Analysis Namespace